experiment_data/ycsb/Tapir/run-rper100-hst3-srv9-thr1-this1.log
YCSB Client 0.1
Command line: -P workloads/workload100 -t -db com.yahoo.ycsb.db.TapirClient -p tapir.configpath=../store/tools/shard -p tapir.nshards=8 -p tapir.closestreplica=1 -p measurement.type=histogram -p histogram.buckets=25 -threads 1 -p operationcount=1000000
Loading workload...
Starting test.
Database validation succeeded
[OVERALL], RunTime(ms), 926015.0
[OVERALL], Throughput(ops/sec), 1079.8961139938338
[READ], Operations, 1000000
[READ], AverageLatency(us), 220.603563
[READ], MinLatency(us), 144
[READ], MaxLatency(us), 9735
[READ], 95thPercentileLatency(ms), 0
[READ], 99thPercentileLatency(ms), 0
[READ], Return=0, 1000000
[READ], 0, 999884
[READ], 1, 79
[READ], 2, 14
[READ], 3, 2
[READ], 4, 11
[READ], 5, 1
[READ], 6, 5
[READ], 7, 1
[READ], 8, 2
[READ], 9, 1
[READ], 10, 0
[READ], 11, 0
[READ], 12, 0
[READ], 13, 0
[READ], 14, 0
[READ], 15, 0
[READ], 16, 0
[READ], 17, 0
[READ], 18, 0
[READ], 19, 0
[READ], 20, 0
[READ], 21, 0
[READ], 22, 0
[READ], 23, 0
[READ], 24, 0
[READ], >25, 0
[COMMIT], Operations, 1000000
[COMMIT], AverageLatency(us), 700.780792
[COMMIT], MinLatency(us), 645
[COMMIT], MaxLatency(us), 502351
[COMMIT], 95thPercentileLatency(ms), 0
[COMMIT], 99thPercentileLatency(ms), 0
[COMMIT], Return=0, 1000000
[COMMIT], 0, 999751
[COMMIT], 1, 172
[COMMIT], 2, 31
[COMMIT], 3, 11
[COMMIT], 4, 22
[COMMIT], 5, 3
[COMMIT], 6, 4
[COMMIT], 7, 1
[COMMIT], 8, 1
[COMMIT], 9, 2
[COMMIT], 10, 0
[COMMIT], 11, 0
[COMMIT], 12, 0
[COMMIT], 13, 0
[COMMIT], 14, 0
[COMMIT], 15, 0
[COMMIT], 16, 0
[COMMIT], 17, 0
[COMMIT], 18, 0
[COMMIT], 19, 0
[COMMIT], 20, 0
[COMMIT], 21, 0
[COMMIT], 22, 0
[COMMIT], 23, 0
[COMMIT], 24, 0
[COMMIT], >25, 2
[START], Operations, 1000000
[START], AverageLatency(us), 1.010373
[START], MinLatency(us), 0
[START], MaxLatency(us), 2073
[START], 95thPercentileLatency(ms), 0
[START], 99thPercentileLatency(ms), 0
[START], Return=0, 1000000
[START], 0, 999999
[START], 1, 0
[START], 2, 1
[START], 3, 0
[START], 4, 0
[START], 5, 0
[START], 6, 0
[START], 7, 0
[START], 8, 0
[START], 9, 0
[START], 10, 0
[START], 11, 0
[START], 12, 0
[START], 13, 0
[START], 14, 0
[START], 15, 0
[START], 16, 0
[START], 17, 0
[START], 18, 0
[START], 19, 0
[START], 20, 0
[START], 21, 0
[START], 22, 0
[START], 23, 0
[START], 24, 0
[START], >25, 0