experiment_data/ycsb/Tapir/run-rper100-hst3-srv9-thr3-this1.log
YCSB Client 0.1
Command line: -P workloads/workload100 -t -db com.yahoo.ycsb.db.TapirClient -p tapir.configpath=../store/tools/shard -p tapir.nshards=8 -p tapir.closestreplica=1 -p measurement.type=histogram -p histogram.buckets=25 -threads 3 -p operationcount=1000000
Loading workload...
Starting test.
Database validation succeeded
[OVERALL], RunTime(ms), 365854.0
[OVERALL], Throughput(ops/sec), 2733.3280488938212
[READ], Operations, 999999
[READ], AverageLatency(us), 307.77708977708977
[READ], MinLatency(us), 143
[READ], MaxLatency(us), 7251
[READ], 95thPercentileLatency(ms), 0
[READ], 99thPercentileLatency(ms), 0
[READ], Return=0, 999999
[READ], 0, 999669
[READ], 1, 266
[READ], 2, 34
[READ], 3, 14
[READ], 4, 11
[READ], 5, 2
[READ], 6, 1
[READ], 7, 2
[READ], 8, 0
[READ], 9, 0
[READ], 10, 0
[READ], 11, 0
[READ], 12, 0
[READ], 13, 0
[READ], 14, 0
[READ], 15, 0
[READ], 16, 0
[READ], 17, 0
[READ], 18, 0
[READ], 19, 0
[READ], 20, 0
[READ], 21, 0
[READ], 22, 0
[READ], 23, 0
[READ], 24, 0
[READ], >25, 0
[COMMIT], Operations, 999999
[COMMIT], AverageLatency(us), 783.8205558205558
[COMMIT], MinLatency(us), 647
[COMMIT], MaxLatency(us), 502374
[COMMIT], 95thPercentileLatency(ms), 0
[COMMIT], 99thPercentileLatency(ms), 1
[COMMIT], Return=0, 999999
[COMMIT], 0, 988899
[COMMIT], 1, 10901
[COMMIT], 2, 109
[COMMIT], 3, 48
[COMMIT], 4, 19
[COMMIT], 5, 8
[COMMIT], 6, 5
[COMMIT], 7, 2
[COMMIT], 8, 0
[COMMIT], 9, 2
[COMMIT], 10, 0
[COMMIT], 11, 0
[COMMIT], 12, 0
[COMMIT], 13, 0
[COMMIT], 14, 0
[COMMIT], 15, 0
[COMMIT], 16, 0
[COMMIT], 17, 0
[COMMIT], 18, 0
[COMMIT], 19, 0
[COMMIT], 20, 0
[COMMIT], 21, 0
[COMMIT], 22, 0
[COMMIT], 23, 0
[COMMIT], 24, 0
[COMMIT], >25, 6
[START], Operations, 999999
[START], AverageLatency(us), 0.9500549500549501
[START], MinLatency(us), 0
[START], MaxLatency(us), 698
[START], 95thPercentileLatency(ms), 0
[START], 99thPercentileLatency(ms), 0
[START], Return=0, 999999
[START], 0, 999999
[START], 1, 0
[START], 2, 0
[START], 3, 0
[START], 4, 0
[START], 5, 0
[START], 6, 0
[START], 7, 0
[START], 8, 0
[START], 9, 0
[START], 10, 0
[START], 11, 0
[START], 12, 0
[START], 13, 0
[START], 14, 0
[START], 15, 0
[START], 16, 0
[START], 17, 0
[START], 18, 0
[START], 19, 0
[START], 20, 0
[START], 21, 0
[START], 22, 0
[START], 23, 0
[START], 24, 0
[START], >25, 0